Repository: RekGRpth/gawkextlib
Catalog: xml/po/*.po
Languages: es

source: set_array_element failed
es: Error al ejecutar set_array_element()

source: Cannot create XML reserved scalar variable `%s'.
es: No se pudo crear la variable XML reservada `%s'

source: Cannot create XML reserved scalar constant `%s'.
es: No se pudo crear la constante XML reservada `%s'

source: XML reserved scalar variable `%s' already used with incompatible type.
es: La variable XML reservada `%s' ya estaba usada con un tipo incompatible

source: XML reserved array variable `%s' already used with incompatible type.
es: La matriz XML reservada `%s' ya estaba usada con un tipo incompatible

source: `XMLMODE' is a gawk extension
es: `XMLMODE' es una extensión de gawk

source: cannot create XML puller
es: No se pudo crear un XML puller

source: cannot convert space to XMLCHARSET
es: No se pudo convertir un espacio al XMLCHARSET

source: cannot convert slash to XMLCHARSET
es: No se pudo convertir una barra invertida al XMLCHARSET

source: XML_PullerIconv failed to convert event string
es: XML_PullerIconv no pudo convertir el texto de un evento XML
