Repository: RekGRpth/gawkextlib
Catalog: po/*.po
Languages: pl

source: %s: option `-W %s' doesn't allow an argument
pl: %s: opcja `-W %s' nie mo¿e mieæ argumentów

source: cannot open file `%s' for reading (%s)
pl: nie mo¿na otworzyæ pliku `%s' do czytania (%s)

source: close of fd %d (`%s') failed (%s)
pl: zamkniêcie fd %d (`%s') nie powiod³o siê (%s)

source: invalid tree type %s in redirect()
pl: nieprawid³owy typ drzewa %s w funkcji redirect()

source: expression in `%s' redirection only has numeric value
pl: wyra¿enie w przekierowaniu `%s' ma tylko warto¶æ numeryczn±

source: expression for `%s' redirection has null string value
pl: wyra¿enie dla przekierowania `%s' ma zerow± warto¶æ ³añcucha

source: filename `%s' for `%s' redirection may be result of logical expression
pl: nazwa pliku `%s' dla przekierowania `%s' mo¿e byæ rezultatem logicznego wyra¿enia

source: unnecessary mixing of `>' and `>>' for file `%.*s'
pl: niepotrzebne mieszanie `>' i `>>' dla pliku `%.*s'

source: can't open pipe `%s' for output (%s)
pl: nie mo¿na otworzyæ potoku `%s' jako wyj¶cia (%s)

source: can't open pipe `%s' for input (%s)
pl: nie mo¿na otworzyæ potoku `%s' jako wej¶cia (%s)

source: file `%s' is a directory
pl: plik `%s' jest katalogiem

source: can't open two way socket `%s' for input/output (%s)
pl: nie mo¿na otworzyæ dwukierunkowego gniazda `%s' jako wej¶cia/wyj¶cia (%s)

source: can't open two way pipe `%s' for input/output (%s)
pl: nie mo¿na otworzyæ dwukierunkowego potoku `%s' jako wej¶cia/wyj¶cia (%s)

source: can't redirect from `%s' (%s)
pl: nie mo¿na przekierowaæ z `%s' (%s)

source: can't redirect to `%s' (%s)
pl: nie mo¿na przekierowaæ do `%s' (%s)

source: reached system limit for open files: starting to multiplex file descriptors
pl: osi±gniêto systemowy limit otwartych plików: rozpoczêcie multipleksowania deskryptorów plików

source: close of `%s' failed (%s).
pl: zamkniêcie `%s' nie powiod³o siê (%s).

source: too many pipes or input files open
pl: zbyt du¿o otwartych potoków lub plików wej¶ciowych

source: close: second argument must be `to' or `from'
pl: close: drugim argumentem musi byæ `to' lub `from'

source: close: `%.*s' is not an open file, pipe or co-process
pl: close: `%.*s' nie jest ani otwartym plikiem, ani potokiem, ani procesem

source: close: redirection `%s' not opened with `|&', second argument ignored
pl: close: przekierowanie `%s' nie zosta³o otwarte z `|&', drugi argument zignorowany

source: failure status (%d) on pipe close of `%s' (%s)
pl: status awarii (%d) podczas zamykania potoku `%s' (%s)

source: failure status (%d) on file close of `%s' (%s)
pl: status awarii (%d) podczas zamykania pliku `%s' (%s)

source: no explicit close of socket `%s' provided
pl: brak jawnego zamkniêcia gniazdka `%s'

source: no explicit close of co-process `%s' provided
pl: brak jawnego zamkniêcia procesu pomocniczego `%s'

source: no explicit close of pipe `%s' provided
pl: brak jawnego zamkniêcia potoku `%s'

source: no explicit close of file `%s' provided
pl: brak jawnego zamkniêcia pliku `%s'

source: error writing standard output (%s)
pl: b³±d podczas zapisu na standardowe wyj¶cie (%s)

source: error writing standard error (%s)
pl: b³±d podczas zapisu na standardowe wyj¶cie diagnostyczne (%s)

source: pipe flush of `%s' failed (%s).
pl: opró¿nienie potoku `%s' nie powiod³o siê (%s).

source: co-process flush of pipe to `%s' failed (%s).
pl: opró¿nienie potoku do `%s' przez proces pomocniczy nie powiod³o siê (%s).

source: file flush of `%s' failed (%s).
pl: opró¿nienie pliku `%s' nie powiod³o siê (%s).

source: local port %s invalid in `/inet'
pl: nieprawid³owy lokalny port %s w `/inet'

source: remote host and port information (%s, %s) invalid
pl: informacje o zdalnym ho¶cie i porcie s± nieprawid³owe (%s, %s)

source: /inet/raw client not ready yet, sorry
pl: klient /inet/raw nie jest jeszcze gotowy, przykro mi

source: only root may use `/inet/raw'.
pl: tylko superu¿ytkownik (root) mo¿e u¿yæ `/inet/raw'.

source: /inet/raw server not ready yet, sorry
pl: serwer /inet/raw nie jest jeszcze gotowy, przykro mi

source: no (known) protocol supplied in special filename `%s'
pl: nie dostarczono (znanego) protoko³u w specjalnym pliku `%s'

source: special file name `%s' is incomplete
pl: specjalna nazwa pliku `%s' jest niekompletna

source: must supply a remote hostname to `/inet'
pl: nale¿y dostarczyæ nazwê zdalnego hosta do `/inet'

source: must supply a remote port to `/inet'
pl: nale¿y dostarczyæ numer zdalnego portu do `/inet'

source: TCP/IP communications are not supported
pl: Komunikacja TCP/IP nie jest wspierana

source: use `PROCINFO["%s"]' instead of `%s'
pl: u¿yj `PROCINFO["%s"]' zamiast `%s'

source: use `PROCINFO[...]' instead of `/dev/user'
pl: u¿yj `PROCINFO[...]' zamiast `/dev/user'

source: could not open `%s', mode `%s'
pl: nie mo¿na otworzyæ `%s', tryb `%s'

source: close of master pty failed (%s)
pl: zamkniêcie nadrzêdnego pty nie powiod³o siê (%s)

source: close of stdout in child failed (%s)
pl: zamkniêcie standardowego wyj¶cia w procesie potomnym nie powiod³o siê (%s)

source: moving slave pty to stdout in child failed (dup: %s)
pl: przesuniêcie podleg³ego pty na standardowe wyj¶cie w procesie potomnym nie powiod³o siê (dup: %s)

source: close of stdin in child failed (%s)
pl: zamkniêcie standardowego wej¶cia w procesie potomnym nie powiod³o siê (%s)

source: moving slave pty to stdin in child failed (dup: %s)
pl: przesuniêcie podleg³ego pty na standardowe wej¶cie w procesie potomnym nie powiod³o siê (dup: %s)

source: close of slave pty failed (%s)
pl: zamkniêcie podleg³ego pty nie powiod³o siê (%s)

source: moving pipe to stdout in child failed (dup: %s)
pl: przesuniêcie potoku na standardowe wyj¶cie w procesie potomnym nie powiod³o siê (dup: %s)

source: moving pipe to stdin in child failed (dup: %s)
pl: przesuniêcie potoku na standardowe wej¶cie w procesie potomnym nie powiod³o siê (dup: %s)

source: restoring stdout in parent process failed
pl: odzyskanie standardowego wyj¶cia w procesie potomnym nie powiod³o siê

source: restoring stdin in parent process failed
pl: odzyskanie standardowego wej¶cia w procesie potomnym nie powiod³o siê

source: close of pipe failed (%s)
pl: zamkniêcie potoku nie powiod³o siê (%s)

source: `|&' not supported
pl: `|&' nie jest wspierany

source: cannot open pipe `%s' (%s)
pl: nie mo¿na otworzyæ potoku `%s' (%s)

source: cannot create child process for `%s' (fork: %s)
pl: nie mo¿na utworzyæ procesu potomnego dla `%s' (fork: %s)

source: data file `%s' is empty
pl: plik danych `%s' jest pusty

source: could not allocate more input memory
pl: nie mo¿na zarezerwowaæ wiêcej pamiêci wej¶ciowej

source: error reading input file `%s': %s
pl: b³±d podczas czytania z pliku `%s': %s

source: multicharacter value of `RS' is a gawk extension
pl: wieloznakowa warto¶æ `RS' jest rozszerzeniem gawk

source: `-m[fr]' option irrelevant in gawk
pl: nieistotna opcja `-m[fr]' w gawk

source: -m option usage: `-m[fr] nnn'
pl: u¿ycie opcji -m: `-m[fr] nnn'

source: %s: option `-W %s' unrecognized, ignored
pl: %s: opcja `-W %s' nierozpoznana i zignorowana

source: empty argument to `--source' ignored
pl: pusty argument dla opcji `--source' zosta³ zignorowany

source: environment variable `POSIXLY_CORRECT' set: turning on `--posix'
pl: zmienna ¶rodowiskowa `POSIXLY_CORRECT' ustawiona: `--posix' zosta³ w³±czony

source: `--posix' overrides `--traditional'
pl: opcja `--posix' zostanie u¿yta nad `--traditional'

source: `--posix'/`--traditional' overrides `--non-decimal-data'
pl: `--posix'/`--traditional' u¿yte nad opcj± `--non-decimal-data'

source: running %s setuid root may be a security problem
pl: uruchamianie %s setuid root mo¿e byæ problemem pod wzglêdem bezpieczeñstwa

source: can't set binary mode on stdin (%s)
pl: nie mo¿na ustawiæ trybu binarnego na standardowym wej¶ciu (%s)

source: can't set binary mode on stdout (%s)
pl: nie mo¿na ustawiæ trybu binarnego na standardowym wyj¶ciu (%s)

source: can't set binary mode on stderr (%s)
pl: nie mo¿na ustawiæ trybu binarnego na wyj¶ciu diagnostycznym (%s)

source: no program text at all!
pl: brak tekstu programu!

source: Usage: %s [POSIX or GNU style options] -f progfile [--] file ...
pl: U¿ycie: %s [styl opcji POSIX lub GNU] -f plik_z_programem [--] plik ...

source: Usage: %s [POSIX or GNU style options] [--] %cprogram%c file ...
pl: U¿ycie: %s [styl opcji POSIX lub GNU] [--] %cprogram%c plik ...

source: POSIX options: GNU long options:
pl: Opcje POSIX: D³ugie opcje GNU:

source: -f progfile --file=progfile
pl: -f program --file=program

source: -v var=val --assign=var=val
pl: -v zmienna=warto¶æ --assign=zmienna=warto¶æ

source: -m[fr] val
pl: -m[fr] warto¶æ

source: -W dump-variables[=file] --dump-variables[=file]
pl: -W dump-variables[=plik] --dump-variables[=plik]

source: -W exec=file --exec=file
pl: -W exec=plik --exec=plik

source: -W profile[=file] --profile[=file]
pl: -W profile[=plik] --profile[=plik]

source: -W source=program-text --source=program-text
pl: -W source=tekst-programu --source=tekst-programu

source: To report bugs, see node `Bugs' in `gawk.info', which is section `Reporting Problems and Bugs' in the printed version.
pl: Aby zg³osiæ b³±d, prosimy zobaczyæ wêze³ `Bugs' w `gawk.info' lub rozdzia³ p.t. `Reporting Problems and Bugs' w wydrukowanej dokumentacji.

source: gawk is a pattern scanning and processing language. By default it reads standard input and writes standard output.
pl: gawk jest jêzykiem skanowania i przetwarzania wzorców. Program domy¶lnie czyta standardowe wej¶cie i zapisuje standardowe wyj¶cie.

source: Examples: gawk '{ sum += $1 }; END { print sum }' file gawk -F: '{ print $1 }' /etc/passwd
pl: Przyk³ady: gawk '{ suma += $1 }; END { print suma }' plik gawk -F: '{ print $1 }' /etc/passwd

source: Copyright (C) 1989, 1991-%d Free Software Foundation. This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 3 of the License, or (at your option) any later version.
pl: Copyright (C) 1989, 1991-%d Free Software Foundation. Ten program jest wolnym oprogramowaniem; mo¿esz go rozprowadzaæ dalej i/lub modyfikowaæ na warunkach Powszechnej Licencji Publicznej GNU, wydanej przez Fundacjê Wolnego Oprogramowania - wed³ug wersji 3-giej tej Licencji lub której¶ z pó¼niejszych wersji.

source: This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
pl: Ten program rozpowszechniany jest z nadziej±, i¿ bêdzie on u¿yteczny - jednak BEZ JAKIEJKOLWIEK GWARANCJI, nawet domy¶lnej gwarancji PRZYDATNO¦CI HANDLOWEJ albo PRZYDATNO¦CI DO OKRE¦LONYCH ZASTOSOWAÑ. W celu uzyskania bli¿szych informacji przeczytaj Powszechn± Licencjê Publiczn± GNU.

source: -Ft does not set FS to tab in POSIX awk
pl: -Ft nie ustawia FS na znak tabulatora w POSIX awk

source: %s: `%s' argument to `-v' not in `var=value' form
pl: %s: argument `%s' dla `-v' nie jest zgodny ze sk³adni± `zmienna=warto¶æ'

source: `%s' is not a legal variable name
pl: `%s' nie jest dozwolon± nazw± zmiennej

source: `%s' is not a variable name, looking for file `%s=%s'
pl: `%s' nie jest nazw± zmiennej, szukanie pliku `%s=%s'

source: floating point exception
pl: wyj±tek zmiennopozycyjny

source: fatal error: internal error
pl: fatalny b³±d: wewnêtrzny b³±d

source: no pre-opened fd %d
pl: brak ju¿ otwartego fd %d

source: could not pre-open /dev/null for fd %d
pl: nie mo¿na otworzyæ zawczasu /dev/null dla fd %d

source: could not find groups: %s
pl: nie mo¿na znale¼æ grup: %s

source: cmd. line:
pl: linia poleceñ:

source: warning:
pl: ostrze¿enie:

source: error:
pl: b³±d:

source: fatal:
pl: fatalny b³±d:

source: can't convert string to float
pl: nie mo¿na zamieniæ ³añcucha do liczby zmiennopozycyjnej

source: backslash at end of string
pl: backslash na koñcu ³añcucha

source: old awk does not support the `\%c' escape sequence
pl: stary awk nie wspiera sekwencji ucieczki `\%c'

source: POSIX does not allow `\x' escapes
pl: POSIX nie zezwala na sekwencjê ucieczki `\x'

source: no hex digits in `\x' escape sequence
pl: brak liczb szesnastkowych w sekwencji ucieczki `\x'

source: escape sequence `\%c' treated as plain `%c'
pl: sekwencja ucieczki `\%c' potraktowana jako zwyk³e `%c'

source: %s %s `%s': could not set close-on-exec: (fcntl: %s)
pl: %s %s `%s': nie mo¿na ustawiæ close-on-exec: (fcntl: %s)

source: could not open `%s' for writing: %s
pl: nie mo¿na otworzyæ `%s' do zapisu: %s

source: internal error: %s with null vname
pl: wewnêtrzny b³±d: %s z zerowym vname

source: # this is a dynamically loaded extension function
pl: # to jest dynamicznie ³adowana funkcja rozszerzenie

source: # gawk profile, created %s
pl: # profil programu gawk, utworzony %s

source: # BEGIN block(s)
pl: # blok(i) BEGIN

source: # Rule(s)
pl: # Regu³y

source: # END block(s)
pl: # blok(i) END

source: # Functions, listed alphabetically
pl: # Funkcje, spis alfabetyczny

source: unexpected type %s in prec_level
pl: niespodziewany typ %s w prec_level

source: Success
pl: Sukces

source: No match
pl: Brak dopasowania

source: Invalid regular expression
pl: Nieprawid³owe wyra¿enie regularne

source: Invalid collation character
pl: Nieprawid³owy znak porównania

source: Invalid character class name
pl: Nieprawid³owa nazwa klasy znaku

source: Trailing backslash
pl: Koñcowy znak backslash

source: Invalid back reference
pl: Nieprawid³owe odwo³anie wsteczne

source: Unmatched [ or [^
pl: Niedopasowany znak [ lub [^

source: Unmatched ( or \(
pl: Niedopasowany znak ( lub \(

source: Unmatched \{
pl: Niedopasowany znak \{

source: Invalid content of \{\}
pl: Nieprawid³owa zawarto¶æ \{\}

source: Invalid range end
pl: Nieprawid³owy koniec zakresu

source: Memory exhausted
pl: Pamiêæ wyczerpana

source: Invalid preceding regular expression
pl: Nieprawid³owe poprzedzaj±ce wyra¿enie regularne

source: Premature end of regular expression
pl: Przedwczesny koniec wyra¿enia regularnego

source: Regular expression too big
pl: Wyra¿enie regularne jest zbyt du¿e

source: Unmatched ) or \)
pl: Niedopasowany znak ) lub \)

source: No previous regular expression
pl: Brak poprzedniego wyra¿enia regularnego
