Repository: RekGRpth/gawkextlib
Catalog: po/*.po
Languages: pl

source: attempt to use function `%s' as an array
pl: próba u¿ycia funkcji `%s' jako tablicy

source: attempt to use scalar parameter `%s' as an array
pl: próba u¿ycia parametru `%s' skalaru jako tablicy

source: attempt to use scalar `%s' as array
pl: próba u¿ycia skalaru `%s' jako tablicy

source: from %s
pl: od %s

source: reference to uninitialized element `%s["%s"]'
pl: odwo³anie do niezainicjowanego elementu `%s["%s"]'

source: subscript of array `%s' is null string
pl: indeks tablicy `%s' jest zerowym ³añcuchem

source: delete: index `%s' not in array `%s'
pl: delete: indeks `%s' nie jest w tablicy `%s'

source: %s: empty (null)
pl: %s: pusty (null)

source: %s: empty (zero)
pl: %s: pusty (zero)

source: %s: is parameter
pl: %s: jest parametrem

source: %s: array_ref to %s
pl: %s: array_ref do %s

source: %s blocks must have an action part
pl: %s bloków musi posiadaæ czê¶æ dotycz±c± akcji

source: each rule must have a pattern or an action part
pl: ka¿da regu³a musi posiadaæ wzorzec lub czê¶æ dotycz±c± akcji

source: old awk does not support multiple `BEGIN' or `END' rules
pl: stary awk nie wspiera wielokrotnych regu³ `BEGIN' lub `END'

source: `%s' is a built-in function, it cannot be redefined
pl: `%s' jest funkcj± wbudowan±, wiêc nie mo¿e zostaæ ponownie zdefiniowana

source: regexp constant `//' looks like a C++ comment, but is not
pl: sta³e wyra¿enie regularne `//' wygl±da jak komentarz C++, ale nim nie jest

source: regexp constant `/%s/' looks like a C comment, but is not
pl: sta³e wyra¿enie regularne `/%s/' wygl±da jak komentarz C, ale nim nie jest

source: statement may have no effect
pl: instrukcja mo¿e nie mieæ ¿adnego efektu

source: `%s' used in %s action
pl: `%s' u¿yty w akcji %s

source: `nextfile' is a gawk extension
pl: `nextfile' jest rozszerzeniem gawk

source: `return' used outside function context
pl: `return' u¿yty poza kontekstem funkcji

source: plain `print' in BEGIN or END rule should probably be `print ""'
pl: zwyk³y `print' w regu³ach BEGIN lub END powinien prawdopodobnie byæ jako `print ""'

source: `delete array' is a gawk extension
pl: `delete tablica' jest rozszerzeniem gawk

source: `delete(array)' is a non-portable tawk extension
pl: `delete(tablica)' jest nieprzeno¶nym rozszerzeniem tawk

source: duplicate case values in switch body: %s
pl: powielone warto¶ci case w ciele switch: %s

source: Duplicate `default' detected in switch body
pl: wykryto powielony `default' w ciele switch

source: multistage two-way pipelines don't work
pl: wieloetapowe dwukierunkowe linie potokowe nie dzia³aj±

source: regular expression on right of assignment
pl: wyra¿anie regularne po prawej stronie przypisania

source: regular expression on left of `~' or `!~' operator
pl: wyra¿enie regularne po lewej stronie operatora `~' lub `!~'

source: old awk does not support the keyword `in' except after `for'
pl: stary awk nie wspiera s³owa kluczowego `in', z wyj±tkiem po s³owie `for'

source: regular expression on right of comparison
pl: wyra¿enie regularne po prawej stronie porównania

source: non-redirected `getline' undefined inside END action
pl: komenda `getline' bez przekierowania nie jest zdefiniowana wewn±trz akcji END

source: old awk does not support multidimensional arrays
pl: stary awk nie wspiera wielowymiarowych tablic

source: call of `length' without parentheses is not portable
pl: wywo³anie `length' bez nawiasów jest nieprzeno¶ne

source: call of `length' without parentheses is deprecated by POSIX
pl: wywo³anie `length' bez podania nawiasów jest niezalecane przez POSIX

source: use of non-array as array
pl: u¿ycie nie-tablicy jako tablicy

source: invalid subscript expression
pl: nieprawid³owe wyra¿enie indeksowe

source: unexpected newline or end of string
pl: niespodziewany znak nowego wiersza lub koñca ³añcucha

source: empty program text on command line
pl: pusty tekst programu w linii poleceñ

source: can't open source file `%s' for reading (%s)
pl: nie mo¿na otworzyæ pliku ¼ród³owego `%s' do czytania (%s)

source: can't read sourcefile `%s' (%s)
pl: nie mo¿na otworzyæ pliku ¼ród³owego `%s' (%s)

source: source file `%s' is empty
pl: plik ¼ród³owy `%s' jest pusty

source: source file does not end in newline
pl: plik ¼ród³owy nie posiada na koñcu znaku nowego wiersza

source: unterminated regexp ends with `\' at end of file
pl: niezakoñczone prawid³owo wyra¿enie regularne koñczy siê znakiem `\' na koñcu pliku

source: %s: %d: tawk regex modifier `/.../%c' doesn't work in gawk
pl: %s: %d: modyfikator wyra¿enia regularnego `/.../%c' tawk nie dzia³a w gawk

source: tawk regex modifier `/.../%c' doesn't work in gawk
pl: modyfikator wyra¿enia regularnego `/.../%c' tawk nie dzia³a w gawk

source: unterminated regexp
pl: niezakoñczone wyra¿enie regularne

source: unterminated regexp at end of file
pl: niezakoñczone wyra¿enie regularne na koñcu pliku

source: use of `\ #...' line continuation is not portable
pl: u¿ycie `\ #...' kontynuacji linii nie jest przeno¶ne

source: backslash not last character on line
pl: backslash nie jest ostatnim znakiem w wierszu

source: POSIX does not allow operator `**='
pl: POSIX nie zezwala na operator `**='

source: old awk does not support operator `**='
pl: stary awk nie wspiera operatora `**='

source: POSIX does not allow operator `**'
pl: POSIX nie zezwala na operator `**'

source: old awk does not support operator `**'
pl: stary awk nie wspiera operatora `**'

source: operator `^=' is not supported in old awk
pl: operator `^=' nie jest wspierany w starym awk

source: operator `^' is not supported in old awk
pl: operator `^' nie jest wspierany w starym awk

source: unterminated string
pl: niezakoñczony ³añcuch

source: invalid char '%c' in expression
pl: nieprawid³owy znak '%c' w wyra¿eniu

source: `%s' is a gawk extension
pl: `%s' jest rozszerzeniem gawk

source: `%s' is a Bell Labs extension
pl: `%s' jest rozszerzeniem Bell Labs

source: POSIX does not allow `%s'
pl: POSIX nie zezwala na `%s'

source: `%s' is not supported in old awk
pl: `%s' nie jest wspierany w starym awk

source: `goto' considered harmful!
pl: `goto' uwa¿ane za szkodliwe!

source: %d is invalid as number of arguments for %s
pl: %d jest nieprawid³owe jako liczba argumentów dla %s

source: match: third argument is a gawk extension
pl: match: trzeci argument jest rozszerzeniem gawk

source: %s: string literal as last arg of substitute has no effect
pl: %s: litera³ ³añcuchowy jako ostatni argument podstawienia nie ma ¿adnego efektu

source: %s third parameter is not a changeable object
pl: %s trzeci parametr nie jest zmiennym obiektem

source: close: second argument is a gawk extension
pl: close: drugi argument jest rozszerzeniem gawk

source: use of dcgettext(_"...") is incorrect: remove leading underscore
pl: nieprawid³owe u¿ycie dcgettext(_"..."): usuñ znak podkre¶lenia

source: use of dcngettext(_"...") is incorrect: remove leading underscore
pl: nieprawid³owe u¿ycie dcngettext(_"..."): usuñ znak podkre¶lenia

source: function `%s': parameter #%d, `%s', duplicates parameter #%d
pl: funkcja `%s': parametr #%d, `%s', powiela parametr #%d

source: function `%s': parameter `%s' shadows global variable
pl: funkcja `%s': parametr `%s' zas³ania globaln± zmienn±

source: could not open `%s' for writing (%s)
pl: nie mo¿na otworzyæ `%s' do zapisu (%s)

source: sending profile to standard error
pl: wysy³anie profilu na standardowe wyj¶cie diagnostyczne

source: %s: close failed (%s)
pl: %s: zamkniêcie nie powiod³o siê (%s)

source: shadow_funcs() called twice!
pl: shadow_funcs() wywo³ana podwójnie!

source: there were shadowed variables.
pl: wyst±pi³y przykryte zmienne.

source: function `%s': can't use function name as parameter name
pl: funkcja `%s': nie mo¿na u¿yæ nazwy funkcji jako nazwy parametru

source: function name `%s' previously defined
pl: nazwa funkcji `%s' zosta³a zdefiniowana poprzednio

source: function `%s' called but never defined
pl: funkcja `%s' zosta³a wywo³ana, ale nigdy nie zosta³a zdefiniowana

source: function `%s' defined but never called
pl: funkcja `%s' zosta³a zdefiniowana, ale nigdy nie zosta³a wywo³ana

source: regexp constant for parameter #%d yields boolean value
pl: sta³e wyra¿enie regularne dla parametru #%d daje warto¶æ logiczn±

source: function `%s' called with space between name and `(', or used as a variable or an array
pl: funkcja `%s' zosta³a wywo³ana z bia³ymi znakami pomiêdzy jej nazw± a znakiem `(', lub u¿yta jako zmienna lub jako tablica

source: %s to "%s" failed (%s)
pl: %s do "%s" nie powiód³ siê (%s)

source: standard output
pl: standardowe wyj¶cie

source: reason unknown
pl: nieznany powód

source: exp: received non-numeric argument
pl: exp: otrzymano argument nie bêd±cy liczb±

source: exp: argument %g is out of range
pl: exp: argument %g jest poza zasiêgiem

source: fflush: cannot flush: pipe `%s' opened for reading, not writing
pl: fflush: nie mo¿na opró¿niæ: potok `%s' otwarty do czytania, a nie do zapisu

source: fflush: cannot flush: file `%s' opened for reading, not writing
pl: fflush: nie mo¿na opró¿niæ: plik `%s' otwarty do czytania, a nie do zapisu

source: fflush: `%s' is not an open file, pipe or co-process
pl: fflush: `%s' nie jest ani otwartym plikiem, ani potokiem, ani procesem

source: index: received non-string first argument
pl: index: otrzymano pierwszy argument, który nie jest ³añcuchem

source: index: received non-string second argument
pl: index: otrzymano drugi argument, który nie jest ³añcuchem

source: int: received non-numeric argument
pl: int: otrzymano argument, który nie jest liczb±

source: `length(array)' is a gawk extension
pl: `length(tablica)' jest rozszerzeniem gawk

source: length: received non-string argument
pl: length: otrzymano argument, który nie jest ³añcuchem

source: log: received non-numeric argument
pl: log: otrzymano argument, który nie jest liczb±

source: log: received negative argument %g
pl: log: otrzymano ujemny argument %g

source: must use `count$' on all formats or none
pl: nale¿y u¿yæ `count$' we wszystkich formatach lub nic

source: `$' is not permitted in awk formats
pl: `$' jest niedozwolony w formatach awk

source: arg count with `$' must be > 0
pl: argument count z `$' musi byæ > 0

source: arg count %ld greater than total number of supplied arguments
pl: argument count %ld wiêkszy ni¿ ca³kowita suma argumentów dostarczonych

source: `$' not permitted after period in format
pl: `$' jest niedozwolony po kropce w formacie

source: no `$' supplied for positional field width or precision
pl: brak `$' dla pozycyjnej szeroko¶ci pola lub precyzji

source: `l' is meaningless in awk formats; ignored
pl: `l' jest bezsensowny w formatach awk; zignorowany

source: `l' is not permitted in POSIX awk formats
pl: `l' jest niedozwolony w formatach POSIX awk

source: `L' is meaningless in awk formats; ignored
pl: `L' jest bezsensowny w formatach awk; zignorowany

source: `L' is not permitted in POSIX awk formats
pl: `L' jest niedozwolony w formatach POSIX awk

source: `h' is meaningless in awk formats; ignored
pl: `h' jest bezsensowny w formatach awk; zignorowany

source: `h' is not permitted in POSIX awk formats
pl: `h' jest niedozwolony w formatach POSIX awk

source: [s]printf: value %g is out of range for `%%%c' format
pl: [s]printf: warto¶æ %g jest poza zasiêgiem dla formatu `%%%c'

source: not enough arguments to satisfy format string
pl: brak wystarczaj±cej liczby argumentów, aby zaspokoiæ ³añcuch formatuj±cy

source: ^ ran out for this one
pl: zabrak³o ^

source: [s]printf: format specifier does not have control letter
pl: [s]printf: specyfikator formatu nie posiada kontrolnej litery

source: too many arguments supplied for format string
pl: zbyt du¿o podanych argumentów w ³añcuchu formatuj±cym

source: printf: no arguments
pl: printf: brak argumentów

source: sqrt: received non-numeric argument
pl: sqrt: otrzymano argument, który nie jest liczb±

source: sqrt: called with negative argument %g
pl: sqrt: wywo³ana z ujemnym argumentem %g

source: substr: start index %g is invalid, using 1
pl: substr: pocz±tkowy indeks %g jest nieprawid³owy, nast±pi u¿ycie 1

source: substr: non-integer start index %g will be truncated
pl: substr: pocz±tkowy indeks %g, który nie jest liczb± ca³kowit±, zostanie obciêty

source: substr: length %g is not >= 1
pl: substr: d³ugo¶æ %g nie jest >= 1

source: substr: length %g is not >= 0
pl: substr: d³ugo¶æ %g nie jest >= 0

source: substr: non-integer length %g will be truncated
pl: substr: d³ugo¶æ %g, która nie jest liczb± ca³kowit±, zostanie obciêta

source: substr: length %g too big for string indexing, truncating to %g
pl: substr: d³ugo¶æ %g zbyt du¿a dla indeksu ³añcucha, obcinanie do %g

source: substr: source string is zero length
pl: substr: ³añcuch ¼ród³owy ma zerow± d³ugo¶æ

source: substr: start index %g is past end of string
pl: substr: pocz±tkowy indeks %g le¿y poza koñcem ³añcucha

source: substr: length %g at start index %g exceeds length of first argument (%lu)
pl: substr: d³ugo¶æ %g zaczynaj±c od %g przekracza d³ugo¶æ pierwszego argumentu (%lu)

source: strftime: received non-string first argument
pl: strftime: otrzymano pierwszy argument, który nie jest ³añcuchem

source: strftime: received empty format string
pl: strftime: otrzymano pusty ³añcuch formatuj±cy

source: strftime: received non-numeric second argument
pl: strftime: otrzymano drugi argument, który nie jest liczb±

source: mktime: received non-string argument
pl: mktime: otrzymano argument, który nie jest ³añcuchem

source: system: received non-string argument
pl: system: otrzymano argument, który nie jest ³añcuchem

source: reference to uninitialized field `$%d'
pl: odwo³anie do niezainicjowanego pola `$%d'

source: tolower: received non-string argument
pl: tolower: otrzymano argument, który nie jest ³añcuchem

source: toupper: received non-string argument
pl: toupper: otrzymano argument, który nie jest ³añcuchem

source: atan2: received non-numeric first argument
pl: atan2: otrzymano pierwszy argument, który nie jest liczb±

source: atan2: received non-numeric second argument
pl: atan2: otrzymano drugi argument, który nie jest liczb±

source: sin: received non-numeric argument
pl: sin: otrzymano argument, który nie jest liczb±

source: cos: received non-numeric argument
pl: cos: otrzymano argument, który nie jest liczb±

source: srand: received non-numeric argument
pl: srand: otrzymano argument, który nie jest liczb±

source: match: third argument is not an array
pl: match: otrzymano trzeci argument, który nie jest tablic±

source: gensub: third argument of 0 treated as 1
pl: gensub: trzeci argument 0 potraktowany jako 1

source: lshift: received non-numeric first argument
pl: lshift: otrzymano pierwszy argument, który nie jest liczb±

source: lshift: received non-numeric second argument
pl: lshift: otrzymano drugi argument, który nie jest liczb±

source: lshift(%lf, %lf): negative values will give strange results
pl: lshift(%lf, %lf): ujemne warto¶ci spowoduj± dziwne wyniki

source: lshift(%lf, %lf): fractional values will be truncated
pl: lshift(%lf, %lf): u³amkowe warto¶ci zostan± obciête

source: lshift(%lf, %lf): too large shift value will give strange results
pl: lshift(%lf, %lf): zbyt du¿a warto¶æ przesuniêcia spowoduje dziwne wyniki

source: rshift: received non-numeric first argument
pl: rshift: otrzymano pierwszy argument, który nie jest liczb±

source: rshift: received non-numeric second argument
pl: rshift: otrzymano drugi argument, który nie jest liczb±

source: rshift(%lf, %lf): negative values will give strange results
pl: rshift(%lf, %lf): ujemne warto¶ci spowoduj± dziwne wyniki

source: rshift(%lf, %lf): fractional values will be truncated
pl: rshift(%lf, %lf): u³amkowe warto¶ci zostan± obciête

source: rshift(%lf, %lf): too large shift value will give strange results
pl: rshift(%lf, %lf): zbyt du¿a warto¶æ przesuniêcia spowoduje dziwne wyniki

source: and: received non-numeric first argument
pl: and: otrzymano pierwszy argument, który nie jest liczb±

source: and: received non-numeric second argument
pl: and: otrzymano drugi argument, który nie jest liczb±

source: and(%lf, %lf): negative values will give strange results
pl: and(%lf, %lf): ujemne warto¶ci spowoduj± dziwne wyniki

source: and(%lf, %lf): fractional values will be truncated
pl: and(%lf, %lf): u³amkowe warto¶ci zostan± obciête

source: or: received non-numeric first argument
pl: or: otrzymano pierwszy argument, który nie jest liczb±

source: or: received non-numeric second argument
pl: or: otrzymano drugi argument, który nie jest liczb±

source: or(%lf, %lf): negative values will give strange results
pl: or(%lf, %lf): ujemne warto¶ci spowoduj± dziwne wyniki

source: or(%lf, %lf): fractional values will be truncated
pl: or(%lf, %lf): u³amkowe warto¶ci zostan± obciête

source: xor: received non-numeric first argument
pl: xor: otrzymano pierwszy argument, który nie jest liczb±

source: xor: received non-numeric second argument
pl: xor: otrzymano drugi argument, który nie jest liczb±

source: xor(%lf, %lf): negative values will give strange results
pl: xor(%lf, %lf): ujemne warto¶ci spowoduj± dziwne wyniki

source: xor(%lf, %lf): fractional values will be truncated
pl: xor(%lf, %lf): u³amkowe warto¶ci zostan± obciête

source: compl: received non-numeric argument
pl: compl: otrzymano argument, który nie jest liczb±

source: compl(%lf): negative value will give strange results
pl: compl(%lf): ujemne warto¶ci spowoduj± dziwne wyniki

source: compl(%lf): fractional value will be truncated
pl: compl(%lf): u³amkowe warto¶ci zostan± obciête

source: dcgettext: `%s' is not a valid locale category
pl: dcgettext: `%s' nie jest prawid³ow± kategori± lokalizacji

source: unknown nodetype %d
pl: nieznany typ wêz³a %d

source: buffer overflow in genflags2str
pl: przepe³nienie bufora w genflags2str

source: attempt to use array `%s' in a scalar context
pl: próba u¿ycia tablicy `%s' w kontek¶cie skalaru

source: for loop: array `%s' changed size from %ld to %ld during loop execution
pl: pêtla for: tablica `%s' zmieni³a rozmiar z %ld do %ld podczas wykonywania pêtli

source: `break' outside a loop is not portable
pl: instrukcja `break' poza pêtl± jest nieprzeno¶na

source: `break' outside a loop is not allowed
pl: instrukcja `break' poza pêtl± jest niedozwolona

source: `continue' outside a loop is not portable
pl: instrukcja `continue' poza pêtl± jest nieprzeno¶na

source: `continue' outside a loop is not allowed
pl: instrukcja `continue' poza pêtl± jest niedozwolona

source: `next' cannot be called from a BEGIN rule
pl: instrukcja `next' nie mo¿e byæ wywo³ana z wnêtrza regu³y BEGIN

source: `next' cannot be called from an END rule
pl: instrukcja `next' nie mo¿e byæ wywo³ana z wnêtrza regu³y END

source: `nextfile' cannot be called from a BEGIN rule
pl: instrukcja `nextfile' nie mo¿e byæ wywo³ana z wnêtrza regu³y BEGIN

source: `nextfile' cannot be called from an END rule
pl: instrukcja `nextfile' nie mo¿e byæ wywo³ana z wnêtrza regu³y END

source: statement has no effect
pl: instrukcja nie ma ¿adnego efektu

source: can't use function name `%s' as variable or array
pl: nie mo¿na u¿yæ nazwy funkcji `%s' jako zmiennej lub tablicy

source: reference to uninitialized argument `%s'
pl: odwo³anie do niezainicjowanego argumentu `%s'

source: reference to uninitialized variable `%s'
pl: odwo³anie do niezainicjowanej zmiennej `%s'

source: concatenation: side effects in one expression have changed the length of another!
pl: konkatenacja: skutki uboczne w jednym wyra¿eniu spowodowa³y zmianê d³ugo¶ci innego wyra¿enia!

source: assignment used in conditional context
pl: przypisanie u¿yte w kontek¶cie warunkowym

source: division by zero attempted
pl: próba dzielenia przez zero

source: division by zero attempted in `%%'
pl: próba dzielenia przez zero w `%%'

source: illegal type (%s) in tree_eval
pl: nieprawid³owy typ (%s) w tree_eval

source: division by zero attempted in `/='
pl: próba dzielenia przez zero w `/='

source: division by zero attempted in `%%='
pl: próba dzielenia przez zero w `%%='

source: function `%s' called with more arguments than declared
pl: funkcja `%s' zosta³a wywo³ana z wiêksz± ilo¶ci± argumentów ni¿ zosta³o to zadeklarowane

source: function `%s' not defined
pl: funkcja `%s' nie zosta³a zdefiniowana

source: # Function Call Stack:
pl: # Stos Wywo³awczy Funkcji:

source: # -- main --
pl: # -- g³ówne --

source: attempt to field reference from non-numeric value
pl: próba odwo³ania do pola poprzez nienumeryczn± warto¶æ

source: attempt to reference from null string
pl: próba odwo³ania z zerowego ³añcucha

source: attempt to access field %d
pl: próba dostêpu do pola %d

source: assignment is not allowed to result of builtin function
pl: przypisanie do wyniku wbudowanej funkcji nie jest dozwolone

source: `IGNORECASE' is a gawk extension
pl: `IGNORECASE' jest rozszerzeniem gawk

source: `BINMODE' is a gawk extension
pl: `BINMODE' jest rozszerzeniem gawk

source: bad `%sFMT' specification `%s'
pl: z³a specyfikacja `%sFMT' `%s'

source: turning off `--lint' due to assignment to `LINT'
pl: wy³±czenie `--lint' z powodu przypisania do `LINT'

source: `extension' is a gawk extension
pl: `extension' jest rozszerzeniem gawk

source: extension: missing function name
pl: rozszerzenie: brakuj±ca nazwa funkcji

source: extension: illegal character `%c' in function name `%s'
pl: rozszerzenie: nieprawid³owy znak `%c' w nazwie funkcji `%s'

source: extension: can't redefine function `%s'
pl: rozszerzenie: nie mo¿na zredefiniowaæ funkcji `%s'

source: extension: function `%s' already defined
pl: rozserzenie: funkcja `%s' zosta³a ju¿ zdefiniowana

source: extension: can't use gawk built-in `%s' as function name
pl: rozszerzenie: nie mo¿na u¿yæ wbudowanej w gawk `%s' jako nazwy funkcji

source: extension: function name `%s' previously defined
pl: rozserzenie: nazwa funkcji `%s' zosta³a zdefiniowana wcze¶niej

source: function `%s' defined to take no more than %d argument(s)
pl: funkcja `%s' zdefiniowana aby pobraæ nie wiêcej ni¿ %d argument(ów)

source: function `%s': missing argument #%d
pl: funkcja `%s': brakuje #%d argumentu

source: function `%s': argument #%d: attempt to use scalar as an array
pl: funkcja `%s': argument #%d: próba u¿ycia skalaru jako tablicy

source: function `%s': argument #%d: attempt to use array as a scalar
pl: funkcja `%s': argument #%d: próba u¿ycia tablicy jako skalaru

source: NF set to negative value
pl: NF ustawiony na warto¶æ ujemn±

source: split: second argument is not an array
pl: split: drugi argument nie jest tablic±

source: split: null string for third arg is a gawk extension
pl: split: zerowy ³añcuch dla trzeciego argumentu jest rozszerzeniem gawk

source: `FIELDWIDTHS' is a gawk extension
pl: `FIELDWIDTHS' jest rozszerzeniem gawk

source: invalid FIELDWIDTHS value, near `%s'
pl: nieprawid³owa warto¶æ FIELDWIDTHS, w pobli¿u `%s'

source: null string for `FS' is a gawk extension
pl: zerowy ³añcuch dla `FS' jest rozszerzeniem gawk

source: old awk does not support regexps as value of `FS'
pl: stary awk nie wspiera wyra¿eñ regularnych jako warto¶ci `FS'

source: %s: option `%s' is ambiguous
pl: %s: opcja `%s' jest niejednoznaczna

source: %s: option `--%s' doesn't allow an argument
pl: %s: opcja `--%s' nie mo¿e mieæ argumentów

source: %s: option `%c%s' doesn't allow an argument
pl: %s: opcja `%c%s' nie mo¿e mieæ argumentów

source: %s: option `%s' requires an argument
pl: %s: opcja `%s' musi mieæ argument

source: %s: unrecognized option `--%s'
pl: %s: nieznana opcja `--%s'

source: %s: unrecognized option `%c%s'
pl: %s: nieznana opcja `%c%s'

source: %s: illegal option -- %c
pl: %s: niew³a¶ciwa opcja -- %c

source: %s: invalid option -- %c
pl: %s: b³êdna opcja -- %c

source: %s: option requires an argument -- %c
pl: %s: opcja musi mieæ argument -- %c

source: %s: option `-W %s' is ambiguous
pl: %s: opcja `-W %s' jest niejednoznaczna
